INSERT INTO clients (phone_number, surname, name, middle_name, bill) VALUES
(   '+7(905)590-78-63',
    'Иванов',
    'Иван',
    'Иванович',
    10007856001
),
(   '+7(925)700-34-01',
    'Пирогов',
    'Алексей',
    'Николаевич',
    10007856002
),
(   '+7(918)487-26-72',
    'Дубенко',
    'Марина',
    'Дмитриевна',
    10007856003
),
(   '+7(906)777-32-14',
    'Кулакова',
    'Александра',
    'Николаевна',
    10007856004
),
(   '+7(925)489-57-32',
    'Смирнов',
    'Михаил',
    'Валерьевич',
    10007856005
);

INSERT INTO bills (number, funds, active) VALUES
(   10007856001,
    583.00,
    true
),
(   10007856002,
    1000.00,
    true
),
(   10007856003,
    243.00,
    true
),
(   10007856004,
    771.80,
    true
),
(   10007856005,
    0.00,
    false
);

ALTER TABLE clients ADD FOREIGN KEY (bill) REFERENCES bills(number);

UPDATE bills SET client_id = clients.id FROM clients WHERE clients.bill = number;

INSERT INTO services (name, description, cost, active, creation_date, calls_min, internet_gb, sms_number) VALUES
(   'Тариф "Малый"',
    'Небольшие пакеты минут, интернета и смс для тех, кто редко пользуется телефоном',
    250.00,
 	true,
    '01.03.2020',
    100,
    2,
    50
),
(   'Тариф "Средний"',
    'Средние пакеты минут, интернета и смс для тех, кто привык быть всегда на связи, но не хочет переплачивать',
    400.00,
 	true,
    '01.03.2020',
    300,
    5,
    300
),
(   'Тариф "Максимальный"',
    'Максимальные пакеты минут, интернета и смс для тех, кто ни в чем не привык себе отказывать, особенно когда дело касается связи',
    700.00,
 	true,
    '01.03.2020',
    700,
    15,
    500
);

INSERT INTO transactions (bill, type, date, sum) VALUES
(   10007856001,
    'incoming',
   ' 14.04.2020',
    500.00
),
(   10007856003,
    'incoming',
    '10.10.2020',
    400.00
),
(   10007856004,
    'outgoing',
    '23.10.2020',
    700.00
),
(   10007856002,
    'incoming',
    '02.02.2021',
    300.00
);

INSERT INTO services_clients (client_id, service_id, start_date, end_date) VALUES
(   1,
    2,
    '14.04.2020',
    '14.05.2020'
),
(   3,
    1,
    '10.10.2020',
    '10.11.2020'
),
(   4,
    3,
    '23.10.2020',
    '23.11.2020'
),
(   2,
    1,
    '02.02.2021',
    '02.03.2021'
);